//                          Курсова робота
// Виконав: Студент групи АІ-226 Гаврилюк Нікіта Олександрович (7 варінт)
//
// Зміст завдання:
//   Розробити зазначену викладачем динамічну структуру даних. Розробити
// інтерфейс програми, що дозволяє вводити дані і отримувати результати в зручній для
// користувача формі. Програма повинна перевіряти правильність введених даних. У разі
// виникнення помилок повинні видаватися повідомлення.

// Завдання (7 варіант):
//
//   Предметна область – хірургічне відділення лікарні.
// Реалізувати динамічну структуру даних (двобічна черга), що містить наступну
// інформацію:
// Дата, час проведення операції; прізвище, ім’я та по батькові хворого; прізвище,
// ім’я та по батькові хірурга; вид операції за терміновістю (екстрена, планова,
// термінова); мета хірургічного втручання (радикальна, діагностична,
// косметична, реконструктивна, паліативна тощо).
// Програма повинна забезпечувати:
// 1.додавання елемента;
// 2.видалення елемента;
// 3.можливість коригування даних;
// 4.виведення всіх даних;
// 5.пошук операцій, що виконуються заданим хірургом у цей день;
// 6.виведення списку екстрених операцій;
// 7.виведення списку планових операцій, запланованих на цей тиждень;
// 8.підрахунок загальної кількості операцій, що припадають на кожного хірурга;
// 9.пошук операцій за заданою метою хірургічного втручання;

#include <cstdio>
#include <cstdlib>
#include <windows.h>
#include <cstring>
#include <iostream>
#include <time.h>
using namespace std;

//Константа для розміру поля ПІБ хворого
#define SSICK 35
//Константа для розміру поля ПІБ хірурга
#define SSURGEON 35
//Константа для розміру поля Тип операції
#define SOPTYPE 15
//Константа для розміру поля Мета хірургічного втручання
#define SPURPOSE 30

//Всі константи повинні бути заданні цілими додатніми числами в діапазоні 5<константа<100
//Якщо Ви ЗМІНЮЄТЕ значення констант, потрібно ЗАНОВО створити чергу, та записати її у файл

//-------------------------------------------------------
//Структура для пошуку к-сті операцій для кожного хірурга
//-------------------------------------------------------
typedef struct
{
 char Buf_surg[SSURGEON];
} buffer;

//----------------------------------------
//Структура Операційної картки
//----------------------------------------
typedef struct
{
 int day;   //день
 int month; //місяць
 int year;  //рік
} DAT;      //оголошення структурного типу даних DAT


typedef struct
{
      DAT date;  //оголошення змінної date типом DAT для зберігання дати
      float time;  //час
      char PIBsick[SSICK];  //ПІБ хворого
      char PIBsurgeon[SSURGEON]; //ПІБ хірурга
      char optype[SOPTYPE];   //Вид операції
      char purpose[SPURPOSE]; //Мета хірургічного втручання
      int number;  //Номер операційної картки
} opcard;    //оголошення структурного типу opcard
//--------------------------------------


//////////////////////////////
//Структура нового вузла
//////////////////////////////
typedef struct node
{
    opcard data;   //оголошення змінної data типом opcard для зберігання даних про операцію
    struct node *next = nullptr; //вказівник на наступний елемент
    struct node *prev = nullptr; //вказівник на попередній елемент
} node;  //оголошення структурного типу node
//////////////////////////////


//////////////////////////////////////////////////
//Вказівники на початок та кінець двобічної черги
//////////////////////////////////////////////////
struct node *head = new node;    //оголошення вказівника на початок двобічної черги
struct node *tail = new node;    //оголошення вказівника на кінець двобічної черги
//////////////////////////////////////////////////


//---------------------------
//    Прототипи функцій
//---------------------------
  node* create(void);
  void addElemHead(void);
  void addElemTail(void);
  void viewDequeHead(void);
  void viewDequeTail(void);
  void delElemHead(void);
  void delElemTail(void);
  void writeDeque(void);
  void readDeque(void);
  void changeElem(void);
  void searchSurgDay(void);
  void LstOutEmerOper(void);
  void LstOutPlanOper(void);
  void CountOperSurg(void);
  void SearchOpPurpose(void);
  void SortDequeDate(void);
//---------------------------


//////////////////////////////////////////////////
//             Головна функція main
//////////////////////////////////////////////////
int main()
{
 SetConsoleCP(1251);
 SetConsoleOutputCP(1251);
 int det;
 while(1)
      {
       puts("\n===============================================================================");
       puts("\t\t\t         Головне меню");
       puts("===============================================================================");
       puts("\n===============================================================================");
       puts("\t\t\t         Дії з чергою");
       puts("-------------------------------------------------------------------------------");
       puts(" (1) - Додати операцiйну карту спочатку черги");
       puts(" (2) - Додати операцiйну карту з кінця черги");
       puts(" (3) - Переглянути чергу з початку");
       puts(" (4) - Переглянути чергу з кінця");
       puts(" (5) - Видалити операційну картку спочатку черги");
       puts(" (6) - Видалити операційну картку з кінця черги");
       puts(" (7) - Записати чергу до файлу");
       puts(" (8) - Завантажити чергу з файлу");
       puts(" (9) - Редагувати елемент");
       puts("-------------------------------------------------------------------------------");
       puts("\t\t     Навігація по списку операційних карток");
       puts("-------------------------------------------------------------------------------");
       puts(" (10) - Пошук операцій виконуваних хірургом сьогодні ");
       puts(" (11) - Виведення списку екстрених операцій");
       puts(" (12) - Виведення списку планових операцій, запланованих на поточний тиждень");
       puts(" (13) - Підрахунок к-сті операцій на кожного хірурга");
       puts(" (14) - Пошук операцій за заданою метою хірургічного втручання");
       puts(" (15) - Cортування списку операцій за датою проведення");
       puts("-------------------------------------------------------------------------------");
       puts(" (0) - Вихід");
       puts("===============================================================================\n");
       printf(" Введiть код дiї: ");
       scanf("%d", &det);
 switch(det)
       {
        case 1:addElemHead();break;
        case 2:addElemTail(); break;
        case 3:viewDequeHead(); break;
        case 4:viewDequeTail(); break;
        case 5:delElemHead(); break;
        case 6:delElemTail(); break;
        case 7:writeDeque(); break;
        case 8:readDeque(); break;
        case 9:changeElem(); break;
        case 10:searchSurgDay(); break;
        case 11:LstOutEmerOper(); break;
        case 12:LstOutPlanOper(); break;
        case 13:CountOperSurg(); break;
        case 14:SearchOpPurpose(); break;
        case 15:SortDequeDate(); break;
        case 0:
            puts("\n===============================================================================");
            puts("\t\t\tCreated by Nikita Gavrilyuk");
            puts("===============================================================================");
            exit(0);
            break;
        default:
            printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
            printf(" Дію з таким номером не знайдено, повторіть спробу!\n");
            printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
            printf(" Натисніть Enter для продовження.\n");
            fflush(stdin);
            getchar();
            system("cls");
       }
     }
return 0;
}


//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
// Функція для створення нового вузла з
// заданими даними
//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
node* create(void)
{
  node *NewNode = new node;
  int result;
  int length;
    if(NewNode == nullptr)
      {
       puts(" Упссс... Сталась помилка виділення динамічної пам'яті!\n");
       exit(-65);
      }

////////////////////////////////////////////////////////////////////////////////////////

    printf("\n===============================================\n");
    printf("_______________________________________________\n");
    printf("\t   Дата проведення операції:\n");
    printf("-----------------------------------------------\n");
    do{
       printf(" День: ");
       result = scanf("%d",&NewNode->data.date.day);
       if (result==0||NewNode->data.date.day<0||NewNode->data.date.day>31)
         {
          printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
          printf(" День введено некоректно, повторіть спробу!\n");
          printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
          fflush(stdin);
         }
      }while(result==0||NewNode->data.date.day<0||NewNode->data.date.day>31);

////////////////////////////////////////////////////////////////////////////////////////

    fflush(stdin);
    do{
       printf(" Місяць: ");
       result = scanf("%d",&NewNode->data.date.month);
       if(result==0||NewNode->data.date.month<0||NewNode->data.date.month>12)
         {
          printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
          printf(" Місяць введено некоректно, повторіть спробу!\n");
          printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
          fflush(stdin);
         }
      }while(result==0||NewNode->data.date.month<0||NewNode->data.date.month>12);

////////////////////////////////////////////////////////////////////////////////////////

     fflush(stdin);
     do{
        printf(" Рік: ");
        result = scanf("%d",&NewNode->data.date.year);
        if (result==0||NewNode->data.date.year<2023)
          {
           printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
           printf(" Рік введено некоректно, повторіть спробу!\n");
           printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
           fflush(stdin);
          }
      }while(result==0||NewNode->data.date.year<2023);
       printf("_______________________________________________\n\n");

////////////////////////////////////////////////////////////////////////////////////////

    fflush(stdin);
    printf("_______________________________________________\n");
    do{
       printf("  Час проведення операції в форматі (00.00): \n");
       result = scanf("%f",&NewNode->data.time);
       if (result==0||NewNode->data.time<0||NewNode->data.time>23.59)
         {
          printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
          printf(" Час введено некоректно, повторіть спробу!\n");
          printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
          fflush(stdin);
         }
    }while(result==0||NewNode->data.time<0||NewNode->data.time>23.59);
    printf("_______________________________________________\n\n");

////////////////////////////////////////////////////////////////////////////////////////

    fflush(stdin);
    printf("_______________________________________________\n");
    do{
       result = 1;
       printf("\t ПІБ хворого (<%d символів): \n",SSICK);
       fgets(NewNode->data.PIBsick,SSICK,stdin);
       length = strlen(NewNode->data.PIBsick);
       for (int i=0;i<length;i++)
          {
           if (isdigit(NewNode->data.PIBsick[i]))
             {
              result = 0;
              break;
             }
          }
       if (strlen(NewNode->data.PIBsick)<6||result==0)
         {
          printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
          printf(" Поле ПІБ повинно мати >5 сиволів без жодної цифри, повторіть спробу!\n");
          printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
          fflush(stdin);
         }
    }while(result==0||strlen(NewNode->data.PIBsick)<6);
    printf("_______________________________________________\n\n");

////////////////////////////////////////////////////////////////////////////////////////

    fflush(stdin);
    printf("_______________________________________________\n");
    do{
       result = 1;
       printf("\t ПІБ хірурга (<%d символів): \n",SSURGEON);
       fgets(NewNode->data.PIBsurgeon,SSURGEON,stdin);
       length = strlen(NewNode->data.PIBsurgeon);
       for (int i=0;i<length;i++)
          {
           if (isdigit(NewNode->data.PIBsurgeon[i]))
             {
              result = 0;
              break;
             }
          }
       if (strlen(NewNode->data.PIBsurgeon)<6||result==0)
         {
          printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
          printf(" Поле ПІБ повинно мати >5 сиволів без жодної цифри, повторіть спробу!\n");
          printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
          fflush(stdin);
         }
    }while(result==0||strlen(NewNode->data.PIBsurgeon)<6);
    printf("_______________________________________________\n\n");

////////////////////////////////////////////////////////////////////////////////////////

    fflush(stdin);
    printf("_______________________________________________\n");
    do{
       result = 1;
       printf("\tВид операції (<%d символів): \n",SOPTYPE);
       fgets(NewNode->data.optype,SOPTYPE,stdin);
       length = strlen(NewNode->data.optype);
       for (int i=0;i<length;i++)
          {
           if (isdigit(NewNode->data.optype[i]))
             {
              result = 0;
              break;
             }
          }
       if (strlen(NewNode->data.optype)<6||result==0)
         {
          printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
          printf(" Це поле повинно мати >5 сиволів без жодної цифри, повторіть спробу!\n");
          printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
          fflush(stdin);
         }
    }while(strlen(NewNode->data.optype)<6||result==0);
    printf("_______________________________________________\n\n");

////////////////////////////////////////////////////////////////////////////////////////

    fflush(stdin);
    printf("_______________________________________________\n");
    do{
       result = 1;
       printf(" Мета хірургічного втручання (<%d символів): \n",SPURPOSE);
       fgets(NewNode->data.purpose,SPURPOSE,stdin);
       length = strlen(NewNode->data.purpose);
       for (int i=0;i<length;i++)
          {
           if (isdigit(NewNode->data.purpose[i]))
             {
              result = 0;
              break;
             }
          }
        if (strlen(NewNode->data.purpose)<6||result==0)
          {
           printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
           printf(" Це поле повинно мати >5 сиволів без жодної цифри, повторіть спробу!\n");
           printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
           fflush(stdin);
          }
    }while(strlen(NewNode->data.purpose)<6||result==0);
    printf("_______________________________________________\n\n");

////////////////////////////////////////////////////////////////////////////////////////

    printf("===============================================\n\n");
    printf("++++++++++++++++++++++++++++++++++++++++\n");
    printf(" Операційну картку було додано успішно!\n");
    printf("++++++++++++++++++++++++++++++++++++++++\n\n");
    printf(" Натисніть Enter для продовження.\n");
    fflush(stdin);
    getchar();
    NewNode->next = nullptr;
    NewNode->prev = nullptr;
    return NewNode;
}
//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
// Функція для додавання елемента в початок черги №1
//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
void addElemHead(void)
{
    system("cls");
    node *new_elem = create();
    if(head->next == nullptr)
      {
       head->next = tail->prev = new_elem;
       new_elem->data.number = 1;
      }
       else
           {
            new_elem->next = head->next;
            head->next->prev = new_elem;
            head->next = new_elem;
            node *lst = head->next;
            for (int i=1;lst!=nullptr;i++)
               {
                lst->data.number = i;
                lst = lst->next;
               }
           }
     system("cls");
}
//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
// Функція для додавання елемента в кінець черги №2
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
void addElemTail(void)
{
    system("cls");
    node *new_elem = create();
    if(tail->prev == nullptr)
      {
       head->next = tail->prev = new_elem;
       new_elem->data.number = 1;
      }
       else
           {
            int buf = tail->prev->data.number;
            new_elem->data.number = buf+1;
            new_elem->prev = tail->prev;
            tail->prev->next = new_elem;
            tail->prev = new_elem;
           }
     system("cls");
}
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
// Функція для перегляду черги спочатку №3
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
void viewDequeHead(void)
{
    system("cls");
    if(head->next == nullptr)
      {
       printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
       printf(" В черзі немає жодної операційної картки!\n");
       printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
       printf(" Натисніть Enter для продовження.\n");
       fflush(stdin);
       getchar();
       system("cls");
       return;
      }
    node *lst = head->next;
    do{
       printf("\n==============================================\n");
       printf("\t    Операційна картка №%d\n", lst->data.number);
       printf("==============================================\n");
       printf("<-------------------------------------------->\n");
       printf("\tДата проведення: %d.%d.%d\n", lst->data.date.day, lst->data.date.month, lst->data.date.year);
       printf("<-------------------------------------------->\n");
       printf("\tЧас проведення: %2.2f\n", lst->data.time);
       printf("<-------------------------------------------->\n");
       printf("  ПІБ хворого: %s",lst->data.PIBsick);
       printf("<-------------------------------------------->\n");
       printf("  ПІБ хірурга: %s",lst->data.PIBsurgeon);
       printf("<-------------------------------------------->\n");
       printf("\tВид операції: %s",lst->data.optype);
       printf("<-------------------------------------------->\n");
       printf("  Мета хірургічного втручання: %s",lst->data.purpose);
       printf("<-------------------------------------------->\n");
       printf("==============================================\n\n");
       lst = lst->next;
    }while(lst!=nullptr);
    printf(" Натисніть Enter для продовження.\n");
    fflush(stdin);
    getchar();
    system("cls");
}
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
// Функція для перегляду черги з кінця №4
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
void viewDequeTail(void)
{
    system("cls");
    if(tail->prev == nullptr)
      {
       printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
       printf(" В списку немає жодної операційної картки!\n");
       printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
       printf(" Натисніть Enter для продовження.\n");
       fflush(stdin);
       getchar();
       system("cls");
       return;
      }
    node *lst = tail->prev;
    do{
       printf("\n==============================================\n");
       printf("\t    Операційна картка №%d\n", lst->data.number);
       printf("==============================================\n");
       printf("<-------------------------------------------->\n");
       printf("\tДата проведення: %d.%d.%d\n", lst->data.date.day, lst->data.date.month, lst->data.date.year);
       printf("<-------------------------------------------->\n");
       printf("\tЧас проведення: %2.2f\n", lst->data.time);
       printf("<-------------------------------------------->\n");
       printf("  ПІБ хворого: %s",lst->data.PIBsick);
       printf("<-------------------------------------------->\n");
       printf("  ПІБ хірурга: %s",lst->data.PIBsurgeon);
       printf("<-------------------------------------------->\n");
       printf("\tВид операції: %s",lst->data.optype);
       printf("<-------------------------------------------->\n");
       printf("  Мета хірургічного втручання: %s",lst->data.purpose);
       printf("<-------------------------------------------->\n");
       printf("==============================================\n\n");
       lst = lst->prev;
    }while(lst!=nullptr);
    printf(" Натисніть Enter для продовження.\n");
    fflush(stdin);
    getchar();
    system("cls");
}
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
// Функція для видалення елементу спочатку №5
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
void delElemHead(void)
{
 system("cls");
 int buf;
 int confirm;
 printf("\n\n============================================================\n");
 printf(" Введіть номер операційної картки, яку потрібно видалити: ");
 scanf("%d",&buf);

     if (head->next == nullptr)
       {
         printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
         printf(" Черга порожня, для видалення елементу потрібно спочатку його додати!\n");
         printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
         printf(" Натисніть Enter для продовження.\n");
         fflush(stdin);
         getchar();
         system("cls");
         return;
       }

     if (head->next == tail->prev&&buf==1)
       {
        printf("\n--------------------------------------\n");
        printf(" Ви дійсно хочете видалити цей запис?\n\n");
        printf("1 - Так 0 - Ні\n");
        scanf("%d",&confirm);
        printf("--------------------------------------\n\n");
        if(confirm == 1)
        {
         delete head->next;
         head->next = tail->prev = nullptr;
         printf("\n++++++++++++++++++++++++++++++++++++++++++\n");
         printf(" Операційну картку було видалено успішно!\n");
         printf("++++++++++++++++++++++++++++++++++++++++++\n\n");
         printf(" Натисніть Enter для продовження.\n");
         fflush(stdin);
         getchar();
         system("cls");
         return;
        }
        else
            {
             printf(" Натисніть Enter для продовження.\n");
             fflush(stdin);
             getchar();
             system("cls");
             return;
            }
       }
       else if(head->next == tail->prev&&buf!=1)
           {
            printf("\n\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
            printf(" Операційна картка з таким номером відсутня в черзі, повторіть спробу!\n");
            printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
            printf(" Натисніть Enter для продовження.\n");
            fflush(stdin);
            getchar();
            system("cls");
            return;
           }


     if (buf==tail->prev->data.number)
       {
        printf("\n-----------------------------------------------------------------------------------------\n");
        printf("\t\t\t Цей елемент знаходиться в кінці черги!\n");
        printf(" Якщо Вам потрібно очистити чергу (видалити цей елемент та всі перед ним), натисніть - 1\n");
        printf(" Якщо Вам потрібно видалити тільки цей елемент, натисніть - 0, та оберіть дію (6)\n");
        printf("-----------------------------------------------------------------------------------------\n\n");
        printf(" Ваш вибір: ");
        scanf("%d",&confirm);
        if (confirm == 1)
          {
           do{
              head->next = head->next->next;
              delete head->next->prev;
             }while(head->next->data.number!=tail->prev->data.number);
           delete tail->prev;
           head->next = nullptr;
           tail->prev = nullptr;
           printf("\n++++++++++++++++++++++++\n");
           printf(" Чергу очищено успішно!\n");
           printf("++++++++++++++++++++++++\n\n");
           printf(" Натисніть Enter для продовження.\n");
           fflush(stdin);
           getchar();
           system("cls");
           return;
          }
           else
               {
                printf(" \nНатисніть Enter для продовження.\n");
                fflush(stdin);
                getchar();
                system("cls");
                return;
               }
       }

        if (buf==1)
          {
           printf("--------------------------------------\n");
           printf(" Ви дійсно хочете видалити цей запис?\n\n");
           printf("1 - Так 0 - Ні\n");
           scanf("%d",&confirm);
           printf("--------------------------------------\n");
           if (confirm == 1)
             {
              head->next = head->next->next;
              delete head->next->prev;
              head->next->prev = nullptr;
              node *lst = head->next;
              for (int i=1;lst!=nullptr;i++)
                 {
                  lst->data.number = i;
                  lst = lst->next;
                 }
              printf("\n++++++++++++++++++++++++++++++++++++++++++\n");
              printf(" Операційну картку було видалено успішно!\n");
              printf("++++++++++++++++++++++++++++++++++++++++++\n\n");
              printf(" Натисніть Enter для продовження.\n");
              fflush(stdin);
              getchar();
              system("cls");
              return;
             }
             else
                 {
                  printf(" Натисніть Enter для продовження.\n");
                  fflush(stdin);
                  getchar();
                  system("cls");
                  return;
                 }
         }
         else if (buf<tail->prev->data.number&&buf>0)
             {
              printf("--------------------------------------------------------------------------------------------------\n");
              printf(" Елемент знаходиться в середині черги, потрібно видалити всі елементи, які знаходяться перед ним!\n\n");
              printf("--------------------------------------\n");
              printf(" Ви дійсно хочете видалити цей запис?\n\n");
              printf(" 1 - Так 0- Ні\n");
              scanf("%d",&confirm);
              printf("--------------------------------------\n");
              if (confirm == 1)
                {
                 do{
                    head->next = head->next->next;
                    delete head->next->prev;
                    head->next->prev = nullptr;
                   } while (head->next->data.number!=buf+1);
                 node *lst = head->next;
                 for (int i=1;lst!=nullptr;i++)
                    {
                     lst->data.number = i;
                     lst = lst->next;
                    }
                 printf("--------------------------------------------------------------------------------------------------\n");
                 printf("\n++++++++++++++++++++++++++++++++++++++++++\n");
                 printf(" Операційну картку було видалено успішно!\n");
                 printf("++++++++++++++++++++++++++++++++++++++++++\n\n");
                 printf(" Натисніть Enter для продовження.\n");
                 fflush(stdin);
                 getchar();
                 system("cls");
                 return;
                }
                else
                    {
                     printf(" Натисніть Enter для продовження.\n");
                     fflush(stdin);
                     getchar();
                     system("cls");
                     return;
                    }
             }
             else
                 {
                  printf("\n\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
                  printf(" Операційна картка з таким номером відсутня в черзі, повторіть спробу!\n");
                  printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
                  printf(" Натисніть Enter для продовження.\n");
                  fflush(stdin);
                  getchar();
                  system("cls");
                  return;
                 }
}
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
// Функція для видалення елементу з кінця №6
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
void delElemTail(void)
{
 system("cls");
 int buf;
 int confirm;
 printf("\n\n============================================================\n");
 printf(" Введіть номер операційної картки, яку потрібно видалити: ");
 scanf("%d",&buf);

     if (head->next == nullptr)
       {
        printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
        printf(" Черга порожня, для видалення елементу потрібно спочатку його додати!\n");
        printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
        printf(" Натисніть Enter для продовження.\n");
        fflush(stdin);
        getchar();
        system("cls");
        return;
       }

     if (head->next == tail->prev&&buf==1)
       {
        printf("--------------------------------------\n");
        printf(" Ви дійсно хочете видалити цей запис?\n\n");
        printf("1 - Так 0 - Ні\n");
        scanf("%d",&confirm);
        printf("--------------------------------------\n");
        if (confirm == 1)
          {
           delete head->next;
           head->next = tail->prev = nullptr;
           printf("\n++++++++++++++++++++++++++++++++++++++++++\n");
           printf(" Операційну картку було видалено успішно!\n");
           printf("++++++++++++++++++++++++++++++++++++++++++\n\n");
           printf(" Натисніть Enter для продовження.\n");
           fflush(stdin);
           getchar();
           system("cls");
           return;
          }
          else
              {
               printf(" Натисніть Enter для продовження.\n");
               fflush(stdin);
               getchar();
               system("cls");
               return;
              }
       }
       else if(head->next == tail->prev&&buf!=1)
           {
            printf("\n\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
            printf(" Операційна картка з таким номером відсутня в черзі, повторіть спробу!\n");
            printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
            printf(" Натисніть Enter для продовження.\n");
            fflush(stdin);
            getchar();
            system("cls");
            return;
           }

     if (buf==head->next->data.number)
       {
        printf("\n-----------------------------------------------------------------------------------------\n");
        printf("\t\t\t Цей елемент знаходиться спочатку черги!\n");
        printf(" Якщо Вам потрібно очистити чергу (видалити цей елемент та всі після нього), натисніть - 1\n");
        printf(" Якщо Вам потрібно видалити тільки цей елемент, натисніть - 0, та оберіть дію (5)\n");
        printf("-----------------------------------------------------------------------------------------\n\n");
        fflush(stdin);
        printf(" Ваш вибір: ");
        scanf("%d",&confirm);
        if (confirm == 1)
          {
           do{
              head->next = head->next->next;
              delete head->next->prev;
             }while(head->next->data.number!=tail->prev->data.number);
           delete tail->prev;
           head->next = nullptr;
           tail->prev = nullptr;
           printf("\n++++++++++++++++++++++++\n");
           printf(" Чергу очищено успішно!\n");
           printf("++++++++++++++++++++++++\n\n");
           printf(" Натисніть Enter для продовження.\n");
           fflush(stdin);
           getchar();
           system("cls");
           return;
          }
           else
               {
                printf(" \nНатисніть Enter для продовження.\n");
                fflush(stdin);
                getchar();
                system("cls");
                return;
               }
       }

        if (buf==tail->prev->data.number)
          {
           printf("--------------------------------------\n");
           printf(" Ви дійсно хочете видалити цей запис?\n\n");
           printf("1 - Так 0 - Ні\n");
           scanf("%d",&confirm);
           printf("--------------------------------------\n");
           if (confirm == 1)
             {
              tail->prev = tail->prev->prev;
              delete tail->prev->next;
              tail->prev->next = nullptr;
              printf("\n++++++++++++++++++++++++++++++++++++++++++\n");
              printf(" Операційну картку було видалено успішно!\n");
              printf("++++++++++++++++++++++++++++++++++++++++++\n\n");
              printf(" Натисніть Enter для продовження.\n");
              fflush(stdin);
              getchar();
              system("cls");
              return;
             }
             else
                 {
                  printf(" Натисніть Enter для продовження.\n");
                  fflush(stdin);
                  getchar();
                  system("cls");
                  return;
                 }
         }
         else if(buf<tail->prev->data.number&&buf>0)
             {
              printf("--------------------------------------------------------------------------------------------------\n");
              printf("Елемент знаходиться в середині черги, потрібно видалити всі елементи, які знаходяться після нього!\n\n");
              printf("--------------------------------------\n");
              printf(" Ви дійсно хочете видалити цей запис?\n\n");
              printf("1 - Так 0- Ні\n");
              scanf("%d",&confirm);
              printf("--------------------------------------\n");
              if (confirm == 1)
                {
                 do{
                    tail->prev = tail->prev->prev;
                    delete tail->prev->next;
                    tail->prev->next = nullptr;
                   }while(tail->prev->data.number!=buf-1);
                 printf("--------------------------------------------------------------------------------------------------\n");
                 printf("\n++++++++++++++++++++++++++++++++++++++++++\n");
                 printf(" Операційну картку було видалено успішно!\n");
                 printf("++++++++++++++++++++++++++++++++++++++++++\n\n");
                 printf(" Натисніть Enter для продовження.\n");
                 fflush(stdin);
                 getchar();
                 system("cls");
                 return;
                }
                else
                    {
                     printf(" Натисніть Enter для продовження.\n");
                     fflush(stdin);
                     getchar();
                     system("cls");
                     return;
                    }
             }
             else
                 {
                  printf("\n\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
                  printf(" Операційна картка з таким номером відсутня в черзі, повторіть спробу!\n");
                  printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
                  printf(" Натисніть Enter для продовження.\n");
                  fflush(stdin);
                  getchar();
                  system("cls");
                  return;
                 }
}
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
// Функція для запису черги до файлу №7
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
void writeDeque(void)
{
      system("cls");
      if (head->next == nullptr)
       {
         printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
         printf(" Черга порожня, для запису елементів до файлу, потрібно спочатку їх додати!\n");
         printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
         printf(" Натисніть Enter для продовження.\n");
         fflush(stdin);
         getchar();
         system("cls");
         return;
       }
       else
           {
            FILE *Defile = fopen("DoubleDeque.dat","wb");
            if (Defile == NULL)
              {
               printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
               printf(" Упсс... Не вдалося відкрити для запису файл!\n");
               printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
               printf(" Натисніть Enter для продовження.\n");
               fflush(stdin);
               getchar();
               system("cls");
               return;
              }
            node *lst = head->next;
            while (lst!=nullptr)
                 {
                  fwrite(&lst->data, sizeof(opcard), 1, Defile);
                  lst = lst->next;
                 }
            fclose(Defile);
            printf("\n++++++++++++++++++++++++++++++++++\n");
            printf(" Запис до файлу виконано успішно!\n");
            printf("++++++++++++++++++++++++++++++++++\n\n");
            printf(" Натисніть Enter для продовження.\n");
            fflush(stdin);
            getchar();
            system("cls");
            return;
           }
}
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
// Функція для завантаження черги з файлу №8
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
void readDeque(void)
{
     system("cls");
     if (head->next != nullptr)
       {
         printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
         printf(" В черзі вже є елементи, щоб завантажити чергу з файлу потрібно щоб вона була порожня!\n");
         printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
         printf(" Натисніть Enter для продовження.\n");
         fflush(stdin);
         getchar();
         system("cls");
         return;
       }
       else
           {
            FILE *Defile = fopen("DoubleDeque.dat","rb");
            if (Defile == NULL)
              {
               printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
               printf(" Вказаний файл не існує, або його ім'я вказано некоректно!\n");
               printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
               printf(" Натисніть Enter для продовження.\n");
               fflush(stdin);
               getchar();
               system("cls");
               return;
              }
            while (1)
                 {
                  node *NewNode = new node;
                  int result = fread(&NewNode->data, sizeof(opcard), 1, Defile);
                  if (result != 1)
                    {
                     delete NewNode;
                     break;
                    }
                  if(head->next == nullptr)
                    {
                     head->next = tail->prev = NewNode;
                     NewNode->prev = nullptr;
                     NewNode->next = nullptr;
                    }
                     else
                         {
                          NewNode->prev = tail->prev;
                          tail->prev->next = NewNode;
                          tail->prev = NewNode;
                         }
                  }
            fclose(Defile);
           }
     printf("\n++++++++++++++++++++++++++++++++++++++++++++++\n");
     printf(" Завантаження черги з файлу виконано успішно!\n");
     printf("++++++++++++++++++++++++++++++++++++++++++++++\n\n");
     printf(" Натисніть Enter для продовження.\n");
     fflush(stdin);
     getchar();
     system("cls");
     return;
}
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
// Функція для зміни елемнтів черги №9
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
void changeElem(void)
{
 system("cls");
 if (head->next == nullptr)
   {
    printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
    printf(" Черга порожня, для редагування елементу потрібно спочатку його додати!\n");
    printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
    printf(" Натисніть Enter для продовження.\n");
    fflush(stdin);
    getchar();
    system("cls");
    return;
   }
    else
        {
         int num, cou = 0;
         int result;
         int length;
         printf("\n Введіть номер елементу який потрібно змінити: ");
         scanf("%d",&num);
         node *lst = head->next;
         while (lst!=nullptr)
              {
               if (lst->data.number == num)
                 {
                  cou++;
                  break;
                 }
                  else
                      {
                       lst = lst->next;
                      }
              }
         if (cou == 0)
           {
            printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
            printf(" Елементів з таким номером не знайдено, повторіть спробу!\n");
            printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
            printf(" Натисніть Enter для продовження.\n");
            fflush(stdin);
            getchar();
            system("cls");
            return;
           }
         while (1)
              {
               system("cls");
               printf("\n===========================================\n");
               printf(" (1) - Змінити день\n");
               printf(" (2) - Змінити місяць\n");
               printf(" (3) - Змінити рік\n");
               printf(" (4) - Змінити час\n");
               printf(" (5) - Змінити ПІБ хворого\n");
               printf(" (6) - Змінити ПІБ хірурга\n");
               printf(" (7) - Змінити вид операції\n");
               printf(" (8) - Змінити мету хірургічного втручання\n");
               printf(" (9) - Переглянути змінюваний елемент\n");
               printf("-------------------------------------------\n");
               printf(" (0) - Вихід\n");
               printf("===========================================\n");
               printf("Ваш вибір: ");
               scanf("%d",&num);
               printf("\n");
               switch (num)
                     {
                      case 1:
                             do{
                                printf(" День: ");
                                result = scanf("%d",&lst->data.date.day);
                                if (result==0||lst->data.date.day<0||lst->data.date.day>31)
                                  {
                                   printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
                                   printf(" День введено некоректно, повторіть спробу!\n");
                                   printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
                                   fflush(stdin);
                                  }
                                }while(result==0||lst->data.date.day<0||lst->data.date.day>31);
                             break;
                      case 2:
                             do{
                                printf(" Місяць: ");
                                result = scanf("%d",&lst->data.date.month);
                                if (result==0||lst->data.date.month<0||lst->data.date.month>12)
                                  {
                                   printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
                                   printf(" Місяць введено некоректно, повторіть спробу!\n");
                                   printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
                                   fflush(stdin);
                                  }
                                }while(result==0||lst->data.date.month<0||lst->data.date.month>12);
                             break;
                      case 3:
                             do{
                                printf(" Рік: ");
                                result = scanf("%d",&lst->data.date.year);
                                if (result==0||lst->data.date.year<2023)
                                  {
                                   printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
                                   printf(" Рік введено некоректно, повторіть спробу!\n");
                                   printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
                                   fflush(stdin);
                                  }
                                }while(result==0||lst->data.date.year<2023);
                             break;
                      case 4:
                             do{
                                printf("  Час проведення операції в форматі (00.00): \n");
                                result = scanf("%f",&lst->data.time);
                                if (result==0||lst->data.time<0||lst->data.time>23.59)
                                  {
                                   printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
                                   printf(" Час введено некоректно, повторіть спробу!\n");
                                   printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
                                   fflush(stdin);
                                  }
                                }while(result==0||lst->data.time<0||lst->data.time>23.59);
                             break;
                      case 5:
                             do{
                                result = 1;
                                printf("\t ПІБ хворого (<%d символів): \n",SSICK);
                                fflush(stdin);
                                fgets(lst->data.PIBsick,SSICK,stdin);
                                length = strlen(lst->data.PIBsick);
                                for (int i=0;i<length;i++)
                                   {
                                    if (isdigit(lst->data.PIBsick[i]))
                                      {
                                       result = 0;
                                       break;
                                      }
                                   }
                                 if(strlen(lst->data.PIBsick)<6||result==0)
                                   {
                                    printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
                                    printf(" Поле ПІБ повинно мати >5 сиволів без жодної цифри, повторіть спробу!\n");
                                    printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
                                    fflush(stdin);
                                   }
                                }while(strlen(lst->data.PIBsick)<6||result==0);
                             break;
                      case 6:
                              do{
                                 result = 1;
                                 printf("\t ПІБ хірурга (<%d символів): \n",SSURGEON);
                                 fflush(stdin);
                                 fgets(lst->data.PIBsurgeon,SSURGEON,stdin);
                                 length = strlen(lst->data.PIBsurgeon);
                                 for (int i=0;i<length;i++)
                                    {
                                     if (isdigit(lst->data.PIBsurgeon[i]))
                                       {
                                        result = 0;
                                        break;
                                       }
                                    }
                                 if(strlen(lst->data.PIBsurgeon)<6||result==0)
                                   {
                                    printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
                                    printf(" Поле ПІБ повинно мати >5 сиволів без жодної цифри, повторіть спробу!\n");
                                    printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
                                    fflush(stdin);
                                   }
                                 }while(strlen(lst->data.PIBsurgeon)<6||result==0);
                             break;
                      case 7:
                             do{
                                result = 1;
                                printf("\tВид операції (<%d символів): \n",SOPTYPE);
                                fflush(stdin);
                                fgets(lst->data.optype,SOPTYPE,stdin);
                                length = strlen(lst->data.optype);
                                for (int i=0;i<length;i++)
                                   {
                                    if (isdigit(lst->data.optype[i]))
                                      {
                                       result = 0;
                                       break;
                                      }
                                   }
                                if(strlen(lst->data.optype)<6||result==0)
                                  {
                                   printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
                                   printf(" Це поле повинно мати >5 сиволів без жодної цифри, повторіть спробу!\n");
                                   printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
                                   fflush(stdin);
                                  }
                                }while(strlen(lst->data.optype)<6||result==0);
                             break;
                      case 8:
                             do{
                                result = 1;
                                printf(" Мета хірургічного втручання (<%d символів): \n",SPURPOSE);
                                fflush(stdin);
                                fgets(lst->data.purpose,SPURPOSE,stdin);
                                length = strlen(lst->data.purpose);
                                for (int i=0;i<length;i++)
                                   {
                                    if (isdigit(lst->data.purpose[i]))
                                      {
                                       result = 0;
                                       break;
                                      }
                                   }
                                 if(strlen(lst->data.purpose)<6||result==0)
                                   {
                                    printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
                                    printf(" Це поле повинно мати >5 сиволів без жодної цифри, повторіть спробу!\n");
                                    printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
                                    fflush(stdin);
                                   }
                                }while(strlen(lst->data.purpose)<6||result==0);
                             break;
                      case 9:
                             printf("\n==============================================\n");
                             printf("\t    Операційна картка №%d\n", lst->data.number);
                             printf("==============================================\n");
                             printf("<-------------------------------------------->\n");
                             printf("\tДата проведення: %d.%d.%d\n", lst->data.date.day, lst->data.date.month, lst->data.date.year);
                             printf("<-------------------------------------------->\n");
                             printf("\tЧас проведення: %2.2f\n", lst->data.time);
                             printf("<-------------------------------------------->\n");
                             printf("  ПІБ хворого: %s",lst->data.PIBsick);
                             printf("<-------------------------------------------->\n");
                             printf("  ПІБ хірурга: %s",lst->data.PIBsurgeon);
                             printf("<-------------------------------------------->\n");
                             printf("\tВид операції: %s",lst->data.optype);
                             printf("<-------------------------------------------->\n");
                             printf("  Мета хірургічного втручання: %s",lst->data.purpose);
                             printf("<-------------------------------------------->\n");
                             printf("==============================================\n\n");
                             printf(" Натисніть Enter для продовження.\n");
                             fflush(stdin);
                             getchar();
                             break;
                      case 0:
                             system("cls");
                             return;
                             break;
                      default:
                      printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
                      printf(" Дію з таким номером не знайдено, повторіть спробу!\n");
                      printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
                      printf(" Натисніть Enter для продовження.\n");
                      fflush(stdin);
                      getchar();
                      system("cls");
                    }
              }
        }
}
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
// Функція для пошуку елемнтів за №10
// заданим хірургом у цей день
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
void searchSurgDay(void)
{
 system("cls");
 int result;
 int length;
 int cou=0;
 char buffer[SSURGEON];

 time_t t = time(NULL);  //отримання поточного системного часу
 struct tm *now = localtime(&t);   //перетворення поточного часу в структуру

 //////////////////////////////////////////
 //ініціалізація змінних день,місяць,рік
 int rday = now->tm_mday;
 int rmonth = now->tm_mon + 1;
 int ryear = now->tm_year + 1900;
 /////////////////////////////////////////

   if (head->next == nullptr)
     {
      printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
      printf(" Черга порожня, для пошуку елементів потрібно спочатку їх додати!\n");
      printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
      printf(" Натисніть Enter для продовження.\n");
      fflush(stdin);
      getchar();
      system("cls");
      return;
     }
 do{
    result = 1;
    printf("_______________________________________________\n");
    printf("\t ПІБ хірурга (<%d символів): \n",SSURGEON);
    fflush(stdin);
    fgets(buffer,SSURGEON,stdin);
    length = strlen(buffer);
    for (int i=0;i<length;i++)
       {
        if (isdigit(buffer[i]))
          {
           result = 0;
           break;
          }
       }
    if(strlen(buffer)<6||result==0)
      {
       printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
       printf(" Поле ПІБ повинно мати >5 сиволів без жодної цифри, повторіть спробу!\n");
       printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
       fflush(stdin);
      }
    }while(strlen(buffer)<6||result==0);
    printf("_______________________________________________\n");

 printf("\n===============================================\n");
 printf("\t      Результати пошуку:\n");
 printf("===============================================\n\n");
 node *lst = head->next;
    do{
       result = strcmp(lst->data.PIBsurgeon,buffer);
       /////////////////////////////////////
       int day = lst->data.date.day;      //
       int month = lst->data.date.month;  //скорочення ім'я змінних
       int year = lst->data.date.year;    //
       /////////////////////////////////////
       if (result==0&&day==rday&&month==rmonth&&year==ryear)
         {
          printf("\n==============================================\n");
          printf("\t    Операційна картка №%d\n", lst->data.number);
          printf("==============================================\n");
          printf("<-------------------------------------------->\n");
          printf("\tДата проведення: !!-%d.%d.%d-!!\n", lst->data.date.day, lst->data.date.month, lst->data.date.year);
          printf("<-------------------------------------------->\n");
          printf("\tЧас проведення: %2.2f\n", lst->data.time);
          printf("<-------------------------------------------->\n");
          printf("  ПІБ хворого: %s",lst->data.PIBsick);
          printf("<-------------------------------------------->\n");
          printf("  ПІБ хірурга: !!!-%s",lst->data.PIBsurgeon);
          printf("<-------------------------------------------->\n");
          printf("\tВид операції: %s",lst->data.optype);
          printf("<-------------------------------------------->\n");
          printf("  Мета хірургічного втручання: %s",lst->data.purpose);
          printf("<-------------------------------------------->\n");
          printf("==============================================\n\n");
          cou++;
         }
       lst = lst->next;
      }while(lst!=nullptr);
 if (cou==0)
   {
    printf("\n===============================================\n");
    printf("  За результатами пошуку нічого не знайдено!\n");
    printf("===============================================\n");
    printf(" Натисніть Enter для продовження.\n");
    fflush(stdin);
    getchar();
    system("cls");
    return;
   }
    else
        {
         printf(" Натисніть Enter для продовження.\n");
         fflush(stdin);
         getchar();
         system("cls");
         return;
        }
}
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
// Функція для виведення списку №11
// екстрених операцій
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
void LstOutEmerOper(void)
{
 system("cls");
 int result=1;
 int cou=0;
 char buffer[SOPTYPE]="екстрена\n";
   if (head->next == nullptr)
     {
      printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
      printf(" Черга порожня, для виведення списку елементів потрібно спочатку їх додати!\n");
      printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
      printf(" Натисніть Enter для продовження.\n");
      fflush(stdin);
      getchar();
      system("cls");
      return;
     }

 printf("\n===============================================\n");
 printf("   Результати пошуку екстрених операцій:\n");
 printf("===============================================\n");
 node *lst = head->next;
 do{
    result = strcmp(lst->data.optype,buffer);
    if (result==0)
      {
       printf("\n==============================================\n");
       printf("\t    Операційна картка №%d\n", lst->data.number);
       printf("==============================================\n");
       printf("<-------------------------------------------->\n");
       printf("\tДата проведення: %d.%d.%d\n", lst->data.date.day, lst->data.date.month, lst->data.date.year);
       printf("<-------------------------------------------->\n");
       printf("\tЧас проведення: %2.2f\n", lst->data.time);
       printf("<-------------------------------------------->\n");
       printf("  ПІБ хворого: %s",lst->data.PIBsick);
       printf("<-------------------------------------------->\n");
       printf("  ПІБ хірурга: %s",lst->data.PIBsurgeon);
       printf("<-------------------------------------------->\n");
       printf("\tВид операції: !!!-%s",lst->data.optype);
       printf("<-------------------------------------------->\n");
       printf("  Мета хірургічного втручання: %s",lst->data.purpose);
       printf("<-------------------------------------------->\n");
       printf("==============================================\n\n");
       cou++;
      }
  lst = lst->next;
 }while(lst!=nullptr);

  if (cou==0)
   {
    printf("\n===============================================\n");
    printf("  За результатами пошуку нічого не знайдено!\n");
    printf("===============================================\n");
    printf(" Натисніть Enter для продовження.\n");
    fflush(stdin);
    getchar();
    system("cls");
    return;
   }
    else
        {
         printf(" Натисніть Enter для продовження.\n");
         fflush(stdin);
         getchar();
         system("cls");
         return;
        }
}
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<

//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
// Функція для виведення списку планових №12
// операцій, запланованих на цей тиждень
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
void LstOutPlanOper(void)
{
 system("cls");
    if (head->next == nullptr)
      {
       printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
       printf(" Черга порожня, для виведення списку елементів потрібно спочатку їх додати!\n");
       printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
       printf(" Натисніть Enter для продовження.\n");
       fflush(stdin);
       getchar();
       system("cls");
       return;
      }

 int result=1;
 int cou=0;
 char buffer[SOPTYPE]="планова\n";

 time_t t = time(NULL);     //отримання поточного системного часу
 struct tm *now = localtime(&t);   //перетворення поточного часу в структуру

 ////////////////////////////////////////////////////
 //ініціалізація змінних день,місяць,рік,день неділі
 int rday = now->tm_mday;
 int rmonth = now->tm_mon + 1;
 int ryear = now->tm_year + 1900;
 int weekDay = now->tm_wday;
 ////////////////////////////////////////////////////
 if (weekDay == 0)
   {
    weekDay = 7;
   }

 printf("\n===========================================================================\n");
 printf("   Результати пошуку планових операцій запланованих на поточний тиждень:\n");
 printf("===========================================================================\n");
 node *lst = head->next;
 do{
    result = strcmp(lst->data.optype,buffer);
    /////////////////////////////////////
    int day = lst->data.date.day;      //
    int month = lst->data.date.month;  //скорочення ім'я змінних
    int year = lst->data.date.year;    //
    /////////////////////////////////////
    if (result==0&&month==rmonth&&year==ryear&&day>=rday&&day<=(rday+(7-weekDay)))
      {
       printf("\n==============================================\n");
       printf("\t    Операційна картка №%d\n", lst->data.number);
       printf("==============================================\n");
       printf("<-------------------------------------------->\n");
       printf("\tДата проведення: !!!-%d.%d.%d-!!!\n", lst->data.date.day, lst->data.date.month, lst->data.date.year);
       printf("<-------------------------------------------->\n");
       printf("\tЧас проведення: %2.2f\n", lst->data.time);
       printf("<-------------------------------------------->\n");
       printf("  ПІБ хворого: %s",lst->data.PIBsick);
       printf("<-------------------------------------------->\n");
       printf("  ПІБ хірурга: %s",lst->data.PIBsurgeon);
       printf("<-------------------------------------------->\n");
       printf("\tВид операції: !!!-%s",lst->data.optype);
       printf("<-------------------------------------------->\n");
       printf("  Мета хірургічного втручання: %s",lst->data.purpose);
       printf("<-------------------------------------------->\n");
       printf("==============================================\n\n");
       cou++;
      }
  lst = lst->next;
 }while(lst!=nullptr);

  if (cou==0)
   {
    printf("\n===============================================\n");
    printf("  За результатами пошуку нічого не знайдено!\n");
    printf("===============================================\n");
    printf(" Натисніть Enter для продовження.\n");
    fflush(stdin);
    getchar();
    system("cls");
    return;
   }
    else
        {
         printf(" Натисніть Enter для продовження.\n");
         fflush(stdin);
         getchar();
         system("cls");
         return;
        }
}
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
// Функція для підрахунку загальної №13
// кількості операцій,
// що припадають на кожного хірурга
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
void CountOperSurg(void)
{
 system("cls");
    if (head->next == nullptr)
      {
       printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
       printf(" Черга порожня, для підрахунку елементів потрібно спочатку їх додати!\n");
       printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
       printf(" Натисніть Enter для продовження.\n");
       fflush(stdin);
       getchar();
       system("cls");
       return;
      }

 int sarr = tail->prev->data.number;
 int result=1;
 int cou=0;
 buffer serch[sarr];

 for (int i=0;i<sarr;i++)
    {
     strcpy(serch[i].Buf_surg, "s");
    }

 node *lstA = head->next;
 node *lstB = head->next;

 strcpy(serch[0].Buf_surg, lstA->data.PIBsurgeon);
 lstA = lstB->next;

 for (int i=1;i<sarr;i++)
    {
     for (int j=1;j<lstA->data.number;j++)
        {
         result = strcmp(lstA->data.PIBsurgeon,lstB->data.PIBsurgeon);
         if (result==0)
           {
            break;
           }
         if(lstB->prev!=nullptr)
           {
            lstB = lstB->prev;
           }
        }
     if(result!=0)
       {
        strcpy(serch[i].Buf_surg,lstA->data.PIBsurgeon);
       }
     lstB = lstA;
     lstA = lstA->next;
    }

 lstA = head->next;

 for (int i=0;i<sarr;i++)
    {
     if (strlen(serch[i].Buf_surg)>1)
       {
        for (int j=0;j<sarr;j++)
           {
            result = strcmp(serch[i].Buf_surg,lstA->data.PIBsurgeon);
            if (result==0)
              {
               cou++;
              }
            lstA = lstA->next;
           }
        lstA = head->next;

        printf("\n============================================\n");
        printf(" Хірург - %s",serch[i].Buf_surg);
        printf(" К-сть операцій - %d\n",cou);
        printf("============================================\n\n");
        cou=0;
       }
    }

 printf(" Натисніть Enter для продовження.\n");
 fflush(stdin);
 getchar();
 system("cls");
 return;
}
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
// Пошук операцій за заданною №14
// метою хірургічного втручаня
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
void SearchOpPurpose(void)
{
 system("cls");
 int result;
 int length;
 int cou=0;
 char buffer[SSURGEON];

   if (head->next == nullptr)
     {
      printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
      printf(" Черга порожня, для пошуку елементів потрібно спочатку їх додати!\n");
      printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
      printf(" Натисніть Enter для продовження.\n");
      fflush(stdin);
      getchar();
      system("cls");
      return;
     }

 do{
    printf("_______________________________________________\n");
       result = 1;
       printf(" Мета хірургічного втручання (<%d символів): \n",SPURPOSE);
       fflush(stdin);
       fgets(buffer,SPURPOSE,stdin);
       length = strlen(buffer);
       for (int i=0;i<length;i++)
          {
           if (isdigit(buffer[i]))
             {
              result = 0;
              break;
             }
          }
        if (strlen(buffer)<6||result==0)
          {
           printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
           printf(" Це поле повинно мати >5 сиволів без жодної цифри, повторіть спробу!\n");
           printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
           fflush(stdin);
          }
    }while(strlen(buffer)<6||result==0);
    printf("_______________________________________________\n");

 printf("\n===============================================\n");
 printf("\t      Результати пошуку:\n");
 printf("===============================================\n\n");
 node *lst = head->next;
    do{
       result = strcmp(lst->data.purpose,buffer);
       if (result==0)
         {
          printf("\n==============================================\n");
          printf("\t    Операційна картка №%d\n", lst->data.number);
          printf("==============================================\n");
          printf("<-------------------------------------------->\n");
          printf("\tДата проведення: %d.%d.%d\n", lst->data.date.day, lst->data.date.month, lst->data.date.year);
          printf("<-------------------------------------------->\n");
          printf("\tЧас проведення: %2.2f\n", lst->data.time);
          printf("<-------------------------------------------->\n");
          printf("  ПІБ хворого: %s",lst->data.PIBsick);
          printf("<-------------------------------------------->\n");
          printf("  ПІБ хірурга: %s",lst->data.PIBsurgeon);
          printf("<-------------------------------------------->\n");
          printf("\tВид операції: %s",lst->data.optype);
          printf("<-------------------------------------------->\n");
          printf("  Мета хірургічного втручання: !-%s",lst->data.purpose);
          printf("<-------------------------------------------->\n");
          printf("==============================================\n\n");
          cou++;
         }
       lst = lst->next;
      }while(lst!=nullptr);
 if (cou==0)
   {
    printf("\n===============================================\n");
    printf("  За результатами пошуку нічого не знайдено!\n");
    printf("===============================================\n");
    printf(" Натисніть Enter для продовження.\n");
    fflush(stdin);
    getchar();
    system("cls");
    return;
   }
    else
        {
         printf(" Натисніть Enter для продовження.\n");
         fflush(stdin);
         getchar();
         system("cls");
         return;
        }
}
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
// Функція для сортування списку №15
// операцій за полем «дата» та "час" проведення
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
void SortDequeDate(void)
{
 system("cls");
   if (head->next == nullptr)
     {
      printf("\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
      printf(" Черга порожня, для сортування списку елементів потрібно спочатку їх додати!\n");
      printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n");
      printf(" Натисніть Enter для продовження.\n");
      fflush(stdin);
      getchar();
      system("cls");
      return;
     }

 int sarr = tail->prev->data.number;
 int sum_date1=0;
 int sum_date2=0;
 float time1,time2;

 node *lst_arr[sarr];
 node *buf_sum;
 node *buf_time;

 node *lst = head->next;

 for (int i=0;i<sarr;i++)
    {
     lst_arr[i] = lst;
     lst = lst->next;
    }

 for (int i=0;i<sarr;i++)
    {
     for (int j=0;j<sarr-1;j++)
        {
         sum_date1 = lst_arr[j]->data.date.year * 10000 + lst_arr[j]->data.date.month * 100 + lst_arr[j]->data.date.day;
         sum_date2 = lst_arr[j+1]->data.date.year * 10000 + lst_arr[j+1]->data.date.month * 100 + lst_arr[j+1]->data.date.day;
         if (sum_date2<sum_date1)
           {
            buf_sum = lst_arr[j];
            lst_arr[j] = lst_arr[j+1];
            lst_arr[j+1] = buf_sum;
           }
         if(sum_date2==sum_date1)
           {
            time1 = lst_arr[j]->data.time;
            time2 = lst_arr[j+1]->data.time;
            if (time2<time1)
              {
               buf_time = lst_arr[j];
               lst_arr[j] = lst_arr[j+1];
               lst_arr[j+1] = buf_time;
              }
           }
        }
    }

 printf("\n===========================================================================\n");
 printf("   Результати сортування списку операцій за датою проведення:\n");
 printf("===========================================================================\n");
 for (int i=0;i<sarr;i++)
    {
     printf("\n==============================================\n");
     printf("\t    Операційна картка №%d\n", lst_arr[i]->data.number);
     printf("==============================================\n");
     printf("<-------------------------------------------->\n");
     printf("\tДата проведення: %d.%d.%d\n", lst_arr[i]->data.date.day, lst_arr[i]->data.date.month, lst_arr[i]->data.date.year);
     printf("<-------------------------------------------->\n");
     printf("\tЧас проведення: %2.2f\n", lst_arr[i]->data.time);
     printf("<-------------------------------------------->\n");
     printf("  ПІБ хворого: %s",lst_arr[i]->data.PIBsick);
     printf("<-------------------------------------------->\n");
     printf("  ПІБ хірурга: %s",lst_arr[i]->data.PIBsurgeon);
     printf("<-------------------------------------------->\n");
     printf("\tВид операції: %s",lst_arr[i]->data.optype);
     printf("<-------------------------------------------->\n");
     printf("  Мета хірургічного втручання: %s",lst_arr[i]->data.purpose);
     printf("<-------------------------------------------->\n");
     printf("==============================================\n\n");
    }

 printf(" Натисніть Enter для продовження.\n");
 fflush(stdin);
 getchar();
 system("cls");
 return;
}
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
